In [2]:
import pandas as pd
import numpy as np

In [5]:
# Loading in M2_weekly_Nov1980_to_Feb2021.csv to a Pandas DataFrame
m2_df = pd.read_csv('M2_weekly_Nov1980_to_Feb2021.csv')
m2_df

            DATE       M2
0     1980-11-03   1591.4
1     1980-11-10   1592.9
2     1980-11-17   1596.3
3     1980-11-24   1597.2
4     1980-12-01   1596.1
...          ...      ...
2096  2021-01-04  19081.0
2097  2021-01-11  19453.9
2098  2021-01-18  19470.0
2099  2021-01-25  19419.6
2100  2021-02-01  19417.7

[2101 rows x 2 columns]

In [6]:
# Renaming 'Close' column to 'BTC/USD'
m2_df = m2_df.rename(columns = {'DATE':'Date'})

In [7]:
# Checking data types of btc_df DataFrame
m2_df.dtypes

Date     object
M2      float64
dtype: object

In [8]:
# Converting 'Date' column data type to datetime
m2_df['Date']= pd.to_datetime(m2_df['Date'])

In [9]:
# Confirming 'Date' column data type is now datetime
m2_df.dtypes

Date    datetime64[ns]
M2             float64
dtype: object

In [10]:
m2_df

           Date       M2
0    1980-11-03   1591.4
1    1980-11-10   1592.9
2    1980-11-17   1596.3
3    1980-11-24   1597.2
4    1980-12-01   1596.1
...         ...      ...
2096 2021-01-04  19081.0
2097 2021-01-11  19453.9
2098 2021-01-18  19470.0
2099 2021-01-25  19419.6
2100 2021-02-01  19417.7

[2101 rows x 2 columns]

In [11]:
%store m2_df

Stored 'm2_df' (DataFrame)